---
title: FilterDoubleRule
classe: Autodesk.Revit.DB.FilterDoubleRule
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.FilterNumericValueRule
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# FilterDoubleRule

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Epsilon { get; set; }` | `filterDoubleRule.Epsilon` | Double |
| `Double RuleValue { get; set; }` | `filterDoubleRule.RuleValue` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```